MusicApp/app/controllers/bands_controller.rb

    def index
        @bands = Band.all
---
SELECT  "bands".* FROM "bands" LIMIT $1  [["LIMIT", 1]]